function [Cpom, Cpoi]=calkcpo(x,T);
% Розрахунок ізобарної теплоємності природного газу в ідеально
% газовому стані згідно з ГОСТ 30319.3-96
% Формат застосування: Cpom=calkcpo(x,T),
% де Т - абсолютна температура, К;
% x - вектор мольних часток вмісту 8-ми (ВНИЦ)
% або 18 (AGA8) компонентів природного газу;
% Cpom - ізобарна теплоємність природного
% газу в ідеально газовому стані, кДж/(кмоль*K).
% Cpoi - вектор ізобарної теплоємності компонентів , кДж/(кмоль*K)
% х = [ метан
% етан
% пропан
% н-бутан
% і-бутан
% азот
% вуглекислий газ (СО2)
% сірководень (Н2S) ]
if length(x) == 20
 Xaga=zeros(1,18);
 Xaga(1:5)=x(1:5); Xaga(6:7)=x(11:12);Xaga(8)=x(15);Xaga(9:13)=x(6:10);
 Xaga(13)=Xaga(13)+x(19)+x(20); Xaga(10)=Xaga(10)+x(18);
 Xaga(14)=x(16)+x(13); Xaga(15)=x(14); Xaga(16)=0; Xaga(17)=x(17); Xaga(18)=0;
 x=Xaga;
 %sum(x), pause
end
if length(x)==18
 Xvnic=zeros(1,8);
 Xvnic=x(1:8); Xvnic(4)=Xvnic(4)+sum(x(9:13)); % Correspondly to
 Xvnic(6)=Xvnic(6)+sum(x(14:18)); % GOST 30319.2-96
 x=Xvnic;
 %sum(x), pause
end
R=8.31451; % kDg/(Kmol'*K)
% j 0 1 2 3 4 5 6 7 8 9 10 i
Al=[1.46696186e2 -6.56744186e1 2.02698132e1 -4.20931845e0 6.06743008e-1 - 6.12623969e-2 4.30969226e-3 -2.06597572e-4 6.42615810e-6 -1.16805630e-7 9.40958930e10; % Metan 1
 6.81209760e1 -3.06340580e1 9.52750290e0 -1.69471020e0 1.76305850e-1 - 9.95454020e-3 2.35364300e-4 0 0 0 0 ; % Etan 2
 -9.209726737e1 3.070930782e1 -4.924017995e0 5.045358836e-1 -3.140446759e-2 1.076680079e-3 -1.556890669e-5 0 0 0 0 ; % Propan 3
 -2.096096482e2 6.877783535e1 -1.228650555e1 1.413691547e0 -1.002920638e-1 3.985571861e-3 -6.786460870e-5 0 0 0 0 ; % n-Butan 4
 -3.871419306e1 4.711104578e1 -1.758225423e1 4.183494309e0 -5.520042474e-1 3.034658409e-2 0 0 0 0 0 ; % i-Butan 5
 0.113129000e2 -0.215960000e1 0.352761000e0 -0.321705000e-1 0.167690000e-2 - 0.467965000e-4 0.542603000e-6 0 0 0 0 ; % Azot 6
 -9.508041394e-1 7.008743711e0 -3.505801670e0 1.096778000e0 -2.016835088e-1 1.971024237e-2 -7.860765734e-4 0 0 0 0 ; % CO2 7
 3.91355000e0 -6.84851000e-2 5.64424000e-2 -4.83745000e-3 1.717820000e-4 - 2.275370000e-6 0 0 0 0 0 ]; % H2S 8
% j 1 2 3 4 5 6
Bt=[-2.09233731e2 2.06925203e2 -1.35704831e2 5.64368924e1 -1.34496111e1 1.39664152e0; % Metan
 -8.74070840e1 7.84813740e1 -4.48658590e1 1.46543460e1 -2.05183930e0 0 ;% Etan
 1.748671280e2 -1.756054503e2 8.874920732e1 -1.720610207e1 0 0 ; %Propan
 4.055272850e2 -4.457015773e2 2.743667350e2 -8.643867287e1 1.070428636e1 0 ;% n-Butan
 2.171601450e1 -4.492603200e0 0 0 0 0 ; % i-Butan
 -0.174654000e2 0.246205000e2 -0.217731000e2 0.116418000e2 -0.342122000e1 0.422296000e0 ; % Azot
 1.087462263e0 -7.976765747e-2 -2.837014896e-3 1.479612229e-4 0 0 ; %CO2
 0 0 1.186580000e0 -1.907470000e0 8.28520000e-1 0 ]; % H2S
% i 1 2 3 4 5 6 7 8
Tn=[100 100 100 100 300 100 300 100];
% 2. Calculation chapter
j1=[0:10];
j2=[1:6];
Cpoi=[];
for ind=1:8
 Teta=T/Tn(ind);
 Cpoi(ind)=R.*(sum(Al(ind,:).*Teta.^j1)+sum(Bt(ind,:).*Teta.^((-1).*j2)));
end
% size(x),size(Cpoi)
Cpom=sum(x.*Cpoi); % kDg/(Kmol'*K)